#### `terraform plan` Success
<details><summary>Show Output</summary>

```
 "v=spf1 include:amazonses.com -all" -> null
      - zone_id     = "c1c5d9affc1c33ca4cd808ec4477fc48" -> null
    }

  # module.cloudflare.cloudflare_record.ses_mail_from_spf["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "ses_mail_from_spf" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "email.docklandssinfonia.co.uk"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=spf1 include:amazonses.com -all"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_mail_from_spf["spencerdown.com"] will be created
  + resource "cloudflare_record" "ses_mail_from_spf" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "email.spencerdown.com"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=spf1 include:amazonses.com -all"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_verification_token will be destroyed
  - resource "cloudflare_record" "ses_verification_token" {
      - created_on  = "2016-01-22T13:59:54.87561Z" -> null
      - data        = {} -> null
      - domain      = "docklandssinfonia.co.uk" -> null
      - hostname    = "_amazonses.docklandssinfonia.co.uk" -> null
      - id          = "b095fd5a086327e71df2e5a4361fb6f2" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2016-01-22T13:59:54.87561Z" -> null
      - name        = "_amazonses" -> null
      - priority    = 0 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "xMAcPB7n2FS4UExAFdO2wT4a6MB8vROksrWJlHwzx5Y=" -> null
      - zone_id     = "387a2107669e275d50b5aac0e5ee5313" -> null
    }

  # module.cloudflare.cloudflare_record.ses_verification_token[1] will be destroyed
  - resource "cloudflare_record" "ses_verification_token" {
      - created_on  = "2019-05-06T16:26:25.36475Z" -> null
      - data        = {} -> null
      - domain      = "spencerdown.com" -> null
      - hostname    = "_amazonses.spencerdown.com" -> null
      - id          = "bbfebf4a0824afc7c02516f8d01dc3bd" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-05-06T16:26:25.36475Z" -> null
      - name        = "_amazonses" -> null
      - priority    = 0 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "xsNoZalUtQyAAhzmxEONRIABOEDvrCnKNKG5SUoQrOQ=" -> null
      - zone_id     = "c1c5d9affc1c33ca4cd808ec4477fc48" -> null
    }

  # module.cloudflare.cloudflare_record.ses_verification_token["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "ses_verification_token" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "_amazonses"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = (known after apply)
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_verification_token["spencerdown.com"] will be created
  + resource "cloudflare_record" "ses_verification_token" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "_amazonses"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = (known after apply)
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.site_root will be destroyed
  - resource "cloudflare_record" "site_root" {
      - created_on  = "2016-01-04T14:19:45.321611Z" -> null
      - data        = {} -> null
      - domain      = "docklandssinfonia.co.uk" -> null
      - hostname    = "docklandssinfonia.co.uk" -> null
      - id          = "43c0eca17a1aa5357bb5585e3696ea26" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2016-01-04T14:19:45.321611Z" -> null
      - name        = "docklandssinfonia.co.uk" -> null
      - priority    = 0 -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - value       = "obduk-cms-production.herokuapp.com" -> null
      - zone_id     = "387a2107669e275d50b5aac0e5ee5313" -> null
    }

  # module.cloudflare.cloudflare_record.site_root[1] will be destroyed
  - resource "cloudflare_record" "site_root" {
      - created_on  = "2019-05-06T16:26:24.966689Z" -> null
      - data        = {} -> null
      - domain      = "spencerdown.com" -> null
      - hostname    = "spencerdown.com" -> null
      - id          = "7c7eb66034c613c10f4f9723a9f2799e" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-05-06T16:26:24.966689Z" -> null
      - name        = "spencerdown.com" -> null
      - priority    = 0 -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - value       = "obduk-cms-production.herokuapp.com" -> null
      - zone_id     = "c1c5d9affc1c33ca4cd808ec4477fc48" -> null
    }

  # module.cloudflare.cloudflare_record.site_root["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "site_root" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "docklandssinfonia.co.uk"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "obduk-cms-production.herokuapp.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.site_root["spencerdown.com"] will be created
  + resource "cloudflare_record" "site_root" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "spencerdown.com"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "obduk-cms-production.herokuapp.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.site_www will be destroyed
  - resource "cloudflare_record" "site_www" {
      - created_on  = "2016-01-04T14:18:14.881602Z" -> null
      - data        = {} -> null
      - domain      = "docklandssinfonia.co.uk" -> null
      - hostname    = "www.docklandssinfonia.co.uk" -> null
      - id          = "02f41ed3b85ea8c94cfc661f489255e6" -> null
      - metadata    = {
          - "auto_added"             = "true"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2016-01-04T14:18:14.881602Z" -> null
      - name        = "www" -> null
      - priority    = 0 -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - value       = "obduk-cms-production.herokuapp.com" -> null
      - zone_id     = "387a2107669e275d50b5aac0e5ee5313" -> null
    }

  # module.cloudflare.cloudflare_record.site_www[1] will be destroyed
  - resource "cloudflare_record" "site_www" {
      - created_on  = "2019-05-06T16:26:26.224589Z" -> null
      - data        = {} -> null
      - domain      = "spencerdown.com" -> null
      - hostname    = "www.spencerdown.com" -> null
      - id          = "2bcb4f621f555bb8131a208401b065ad" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-05-06T16:26:26.224589Z" -> null
      - name        = "www" -> null
      - priority    = 0 -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - value       = "obduk-cms-production.herokuapp.com" -> null
      - zone_id     = "c1c5d9affc1c33ca4cd808ec4477fc48" -> null
    }

  # module.cloudflare.cloudflare_record.site_www["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "site_www" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "www"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "obduk-cms-production.herokuapp.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.site_www["spencerdown.com"] will be created
  + resource "cloudflare_record" "site_www" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "www"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "obduk-cms-production.herokuapp.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.spf will be destroyed
  - resource "cloudflare_record" "spf" {
      - created_on  = "2019-12-17T07:09:45.610767Z" -> null
      - data        = {} -> null
      - domain      = "docklandssinfonia.co.uk" -> null
      - hostname    = "docklandssinfonia.co.uk" -> null
      - id          = "83e5703161cb3b2699bceede2d5b1b3f" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-12-17T07:09:45.610767Z" -> null
      - name        = "docklandssinfonia.co.uk" -> null
      - priority    = 0 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "v=spf1 include:_spf.google.com include:servers.mcsv.net -all" -> null
      - zone_id     = "387a2107669e275d50b5aac0e5ee5313" -> null
    }

  # module.cloudflare.cloudflare_record.spf[1] will be destroyed
  - resource "cloudflare_record" "spf" {
      - created_on  = "2019-12-17T07:09:45.855149Z" -> null
      - data        = {} -> null
      - domain      = "spencerdown.com" -> null
      - hostname    = "spencerdown.com" -> null
      - id          = "415b08c56c5a85f491499df53ced03f3" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on = "2019-12-17T07:09:45.855149Z" -> null
      - name        = "spencerdown.com" -> null
      - priority    = 0 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - ttl         = 1 -> null
      - type        = "TXT" -> null
      - value       = "v=spf1 include:_spf.google.com -all" -> null
      - zone_id     = "c1c5d9affc1c33ca4cd808ec4477fc48" -> null
    }

  # module.cloudflare.cloudflare_record.spf["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "spf" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "docklandssinfonia.co.uk"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=spf1 include:_spf.google.com include:servers.mcsv.net -all"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.spf["spencerdown.com"] will be created
  + resource "cloudflare_record" "spf" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "spencerdown.com"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=spf1 include:_spf.google.com include:servers.mcsv.net -all"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_zone.main will be destroyed
  - resource "cloudflare_zone" "main" {
      - id                  = "387a2107669e275d50b5aac0e5ee5313" -> null
      - meta                = {
          - "phishing_detected"  = "false"
          - "wildcard_proxiable" = "false"
        } -> null
      - name_servers        = [
          - "cortney.ns.cloudflare.com",
          - "gabe.ns.cloudflare.com",
        ] -> null
      - paused              = false -> null
      - plan                = "free" -> null
      - status              = "active" -> null
      - type                = "full" -> null
      - vanity_name_servers = [] -> null
      - zone                = "docklandssinfonia.co.uk" -> null
    }

  # module.cloudflare.cloudflare_zone.main[1] will be destroyed
  - resource "cloudflare_zone" "main" {
      - id                  = "c1c5d9affc1c33ca4cd808ec4477fc48" -> null
      - meta                = {
          - "phishing_detected"  = "false"
          - "wildcard_proxiable" = "false"
        } -> null
      - name_servers        = [
          - "cortney.ns.cloudflare.com",
          - "gabe.ns.cloudflare.com",
        ] -> null
      - paused              = false -> null
      - plan                = "free" -> null
      - status              = "active" -> null
      - type                = "full" -> null
      - vanity_name_servers = [] -> null
      - zone                = "spencerdown.com" -> null
    }

  # module.cloudflare.cloudflare_zone.main["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_zone" "main" {
      + id                  = (known after apply)
      + meta                = (known after apply)
      + name_servers        = (known after apply)
      + plan                = (known after apply)
      + status              = (known after apply)
      + type                = "full"
      + vanity_name_servers = (known after apply)
      + zone                = "docklandssinfonia.co.uk"
    }

  # module.cloudflare.cloudflare_zone.main["spencerdown.com"] will be created
  + resource "cloudflare_zone" "main" {
      + id                  = (known after apply)
      + meta                = (known after apply)
      + name_servers        = (known after apply)
      + plan                = (known after apply)
      + status              = (known after apply)
      + type                = "full"
      + vanity_name_servers = (known after apply)
      + zone                = "spencerdown.com"
    }

  # module.cloudflare.cloudflare_zone_settings_override.main will be destroyed
  - resource "cloudflare_zone_settings_override" "main" {
      - id                       = "387a2107669e275d50b5aac0e5ee5313" -> null
      - initial_settings         = [
          - {
              - always_online               = "on"
              - always_use_https            = "on"
              - automatic_https_rewrites    = "off"
              - brotli                      = "on"
              - browser_cache_ttl           = 14400
              - browser_check               = "on"
              - cache_level                 = "simplified"
              - challenge_ttl               = 1800
              - cname_flattening            = "flatten_at_root"
              - development_mode            = "off"
              - edge_cache_ttl              = 7200
              - email_obfuscation           = "on"
              - h2_prioritization           = ""
              - hotlink_protection          = "off"
              - http2                       = "on"
              - image_resizing              = ""
              - ip_geolocation              = "on"
              - ipv6                        = "on"
              - max_upload                  = 100
              - min_tls_version             = "1.0"
              - minify                      = [
                  - {
                      - css  = "off"
                      - html = "off"
                      - js   = "off"
                    },
                ]
              - mirage                      = "off"
              - mobile_redirect             = [
                  - {
                      - mobile_subdomain = ""
                      - status           = "off"
                      - strip_uri        = false
                    },
                ]
              - opportunistic_encryption    = "on"
              - opportunistic_onion         = "on"
              - origin_error_page_pass_thru = "off"
              - polish                      = "off"
              - prefetch_preload            = "off"
              - privacy_pass                = "on"
              - pseudo_ipv4                 = "off"
              - response_buffering          = "off"
              - rocket_loader               = "off"
              - security_header             = [
                  - {
                      - enabled            = true
                      - include_subdomains = true
                      - max_age            = 31536000
                      - nosniff            = true
                      - preload            = true
                    },
                ]
              - security_level              = "medium"
              - server_side_exclude         = "off"
              - sha1_support                = "off"
              - sort_query_string_for_cache = "off"
              - ssl                         = "full"
              - tls_1_2_only                = "off"
              - tls_1_3                     = "on"
              - tls_client_auth             = "off"
              - true_client_ip_header       = "off"
              - waf                         = "off"
              - webp                        = "off"
              - websockets                  = "on"
            },
        ] -> null
      - initial_settings_read_at = "2019-03-23T08:57:42.04995805Z" -> null
      - name                     = "docklandssinfonia.co.uk" -> null
      - readonly_settings        = [
          - "advanced_ddos",
          - "cname_flattening",
          - "http2",
          - "mirage",
          - "origin_error_page_pass_thru",
          - "polish",
          - "prefetch_preload",
          - "response_buffering",
          - "sort_query_string_for_cache",
          - "true_client_ip_header",
          - "waf",
          - "webp",
        ] -> null

      - settings {
          - always_online               = "on" -> null
          - always_use_https            = "on" -> null
          - automatic_https_rewrites    = "on" -> null
          - brotli                      = "on" -> null
          - browser_cache_ttl           = 14400 -> null
          - browser_check               = "on" -> null
          - cache_level                 = "simplified" -> null
          - challenge_ttl               = 1800 -> null
          - cname_flattening            = "flatten_at_root" -> null
          - development_mode            = "off" -> null
          - edge_cache_ttl              = 7200 -> null
          - email_obfuscation           = "on" -> null
          - hotlink_protection          = "off" -> null
          - http2                       = "on" -> null
          - ip_geolocation              = "on" -> null
          - ipv6                        = "on" -> null
          - max_upload                  = 100 -> null
          - min_tls_version             = "1.0" -> null
          - mirage                      = "off" -> null
          - opportunistic_encryption    = "on" -> null
          - opportunistic_onion         = "on" -> null
          - origin_error_page_pass_thru = "off" -> null
          - polish                      = "off" -> null
          - prefetch_preload            = "off" -> null
          - privacy_pass                = "on" -> null
          - pseudo_ipv4                 = "off" -> null
          - response_buffering          = "off" -> null
          - rocket_loader               = "off" -> null
          - security_level              = "medium" -> null
          - server_side_exclude         = "off" -> null
          - sort_query_string_for_cache = "off" -> null
          - ssl                         = "full" -> null
          - tls_1_2_only                = "off" -> null
          - tls_1_3                     = "on" -> null
          - tls_client_auth             = "off" -> null
          - true_client_ip_header       = "off" -> null
          - waf                         = "off" -> null
          - websockets                  = "on" -> null

          - minify {
              - css  = "off" -> null
              - html = "off" -> null
              - js   = "off" -> null
            }

          - mobile_redirect {
              - status    = "off" -> null
              - strip_uri = false -> null
            }

          - security_header {
              - enabled            = true -> null
              - include_subdomains = true -> null
              - max_age            = 31536000 -> null
              - nosniff            = true -> null
              - preload            = true -> null
            }
        }
    }

  # module.cloudflare.cloudflare_zone_settings_override.main[1] will be destroyed
  - resource "cloudflare_zone_settings_override" "main" {
      - id                       = "c1c5d9affc1c33ca4cd808ec4477fc48" -> null
      - initial_settings         = [
          - {
              - always_online               = "on"
              - always_use_https            = "on"
              - automatic_https_rewrites    = "off"
              - brotli                      = "on"
              - browser_cache_ttl           = 14400
              - browser_check               = "on"
              - cache_level                 = "simplified"
              - challenge_ttl               = 1800
              - cname_flattening            = "flatten_at_root"
              - development_mode            = "off"
              - edge_cache_ttl              = 7200
              - email_obfuscation           = "on"
              - h2_prioritization           = ""
              - hotlink_protection          = "off"
              - http2                       = "on"
              - image_resizing              = ""
              - ip_geolocation              = "on"
              - ipv6                        = "on"
              - max_upload                  = 100
              - min_tls_version             = "1.0"
              - minify                      = [
                  - {
                      - css  = "off"
                      - html = "off"
                      - js   = "off"
                    },
                ]
              - mirage                      = "off"
              - mobile_redirect             = [
                  - {
                      - mobile_subdomain = ""
                      - status           = "off"
                      - strip_uri        = false
                    },
                ]
              - opportunistic_encryption    = "on"
              - opportunistic_onion         = "on"
              - origin_error_page_pass_thru = "off"
              - polish                      = "off"
              - prefetch_preload            = "off"
              - privacy_pass                = "on"
              - pseudo_ipv4                 = "off"
              - response_buffering          = "off"
              - rocket_loader               = "off"
              - security_header             = [
                  - {
                      - enabled            = true
                      - include_subdomains = true
                      - max_age            = 31536000
                      - nosniff            = true
                      - preload            = true
                    },
                ]
              - security_level              = "medium"
              - server_side_exclude         = "off"
              - sha1_support                = "off"
              - sort_query_string_for_cache = "off"
              - ssl                         = "full"
              - tls_1_2_only                = "off"
              - tls_1_3                     = "on"
              - tls_client_auth             = "off"
              - true_client_ip_header       = "off"
              - waf                         = "off"
              - webp                        = "off"
              - websockets                  = "on"
            },
        ] -> null
      - initial_settings_read_at = "2019-05-06T16:26:31.371802702Z" -> null
      - name                     = "spencerdown.com" -> null
      - readonly_settings        = [
          - "advanced_ddos",
          - "cname_flattening",
          - "http2",
          - "mirage",
          - "origin_error_page_pass_thru",
          - "polish",
          - "prefetch_preload",
          - "response_buffering",
          - "sort_query_string_for_cache",
          - "true_client_ip_header",
          - "waf",
          - "webp",
        ] -> null

      - settings {
          - always_online               = "on" -> null
          - always_use_https            = "on" -> null
          - automatic_https_rewrites    = "on" -> null
          - brotli                      = "on" -> null
          - browser_cache_ttl           = 14400 -> null
          - browser_check               = "on" -> null
          - cache_level                 = "simplified" -> null
          - challenge_ttl               = 1800 -> null
          - cname_flattening            = "flatten_at_root" -> null
          - development_mode            = "off" -> null
          - edge_cache_ttl              = 7200 -> null
          - email_obfuscation           = "on" -> null
          - hotlink_protection          = "off" -> null
          - http2                       = "on" -> null
          - ip_geolocation              = "on" -> null
          - ipv6                        = "on" -> null
          - max_upload                  = 100 -> null
          - min_tls_version             = "1.0" -> null
          - mirage                      = "off" -> null
          - opportunistic_encryption    = "on" -> null
          - opportunistic_onion         = "on" -> null
          - origin_error_page_pass_thru = "off" -> null
          - polish                      = "off" -> null
          - prefetch_preload            = "off" -> null
          - privacy_pass                = "on" -> null
          - pseudo_ipv4                 = "off" -> null
          - response_buffering          = "off" -> null
          - rocket_loader               = "off" -> null
          - security_level              = "medium" -> null
          - server_side_exclude         = "off" -> null
          - sort_query_string_for_cache = "off" -> null
          - ssl                         = "full" -> null
          - tls_1_2_only                = "off" -> null
          - tls_1_3                     = "on" -> null
          - tls_client_auth             = "off" -> null
          - true_client_ip_header       = "off" -> null
          - waf                         = "off" -> null
          - websockets                  = "on" -> null

          - minify {
              - css  = "off" -> null
              - html = "off" -> null
              - js   = "off" -> null
            }

          - mobile_redirect {
              - status    = "off" -> null
              - strip_uri = false -> null
            }

          - security_header {
              - enabled            = true -> null
              - include_subdomains = true -> null
              - max_age            = 31536000 -> null
              - nosniff            = true -> null
              - preload            = true -> null
            }
        }
    }

  # module.cloudflare.cloudflare_zone_settings_override.main["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_zone_settings_override" "main" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + name                     = "docklandssinfonia.co.uk"
      + readonly_settings        = (known after apply)
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = "on"
          + automatic_https_rewrites    = (known after apply)
          + brotli                      = (known after apply)
          + browser_cache_ttl           = (known after apply)
          + browser_check               = (known after apply)
          + cache_level                 = "simplified"
          + challenge_ttl               = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = (known after apply)
          + edge_cache_ttl              = (known after apply)
          + email_obfuscation           = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = (known after apply)
          + image_resizing              = (known after apply)
          + ip_geolocation              = (known after apply)
          + ipv6                        = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = (known after apply)
          + mirage                      = (known after apply)
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = (known after apply)
          + server_side_exclude         = "off"
          + sha1_support                = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + ssl                         = "full"
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = (known after apply)
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = (known after apply)

          + minify {
              + css  = (known after apply)
              + html = (known after apply)
              + js   = (known after apply)
            }

          + mobile_redirect {
              + mobile_subdomain = (known after apply)
              + status           = (known after apply)
              + strip_uri        = (known after apply)
            }

          + security_header {
              + enabled            = true
              + include_subdomains = true
              + max_age            = 31536000
              + nosniff            = true
              + preload            = true
            }
        }
    }

  # module.cloudflare.cloudflare_zone_settings_override.main["spencerdown.com"] will be created
  + resource "cloudflare_zone_settings_override" "main" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + name                     = "spencerdown.com"
      + readonly_settings        = (known after apply)
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = "on"
          + automatic_https_rewrites    = (known after apply)
          + brotli                      = (known after apply)
          + browser_cache_ttl           = (known after apply)
          + browser_check               = (known after apply)
          + cache_level                 = "simplified"
          + challenge_ttl               = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = (known after apply)
          + edge_cache_ttl              = (known after apply)
          + email_obfuscation           = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = (known after apply)
          + image_resizing              = (known after apply)
          + ip_geolocation              = (known after apply)
          + ipv6                        = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = (known after apply)
          + mirage                      = (known after apply)
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = (known after apply)
          + server_side_exclude         = "off"
          + sha1_support                = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + ssl                         = "full"
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = (known after apply)
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = (known after apply)

          + minify {
              + css  = (known after apply)
              + html = (known after apply)
              + js   = (known after apply)
            }

          + mobile_redirect {
              + mobile_subdomain = (known after apply)
              + status           = (known after apply)
              + strip_uri        = (known after apply)
            }

          + security_header {
              + enabled            = true
              + include_subdomains = true
              + max_age            = 31536000
              + nosniff            = true
              + preload            = true
            }
        }
    }

  # module.heroku.heroku_domain.app will be destroyed
  - resource "heroku_domain" "app" {
      - app      = "obduk-cms-production" -> null
      - cname    = "obduk-cms-production.herokuapp.com" -> null
      - hostname = "www.docklandssinfonia.co.uk" -> null
      - id       = "d6a2b326-f6c6-4951-9ca9-9cc9f4fb2f47" -> null
    }

  # module.heroku.heroku_domain.app[1] will be destroyed
  - resource "heroku_domain" "app" {
      - app      = "obduk-cms-production" -> null
      - cname    = "shielded-marsupial-bfgfaqfy3gjbqg0snung1qn4.herokudns.com" -> null
      - hostname = "www.spencerdown.com" -> null
      - id       = "03859fee-2444-4c0e-8607-6788c8cdb38f" -> null
    }

  # module.heroku.heroku_domain.app["www.docklandssinfonia.co.uk"] will be created
  + resource "heroku_domain" "app" {
      + app      = "obduk-cms-production"
      + cname    = (known after apply)
      + hostname = "www.docklandssinfonia.co.uk"
      + id       = (known after apply)
    }

  # module.heroku.heroku_domain.app["www.spencerdown.com"] will be created
  + resource "heroku_domain" "app" {
      + app      = "obduk-cms-production"
      + cname    = (known after apply)
      + hostname = "www.spencerdown.com"
      + id       = (known after apply)
    }

Plan: 51 to add, 0 to change, 50 to destroy.
```

</details>

*Workflow: `CI`, Action: `hashicorpterraform-github-actions4`, Working Directory: `terraform/app_environment`*
